welcome = '''Привет, {}!
Команды:
/cancel - Отменить текущую операцию и начать с начала
/collage - Создать коллаж
'''

what = ['а?', 'Что?', 'Чего?', 'Что', 'чего?', 'А?', 'Ладно', 'Окей', 'Ок',
        'Как скажешь', 'Да?', 'Не понял', '?', '🤔', '🤨']

send_archive = '''Итак, начнем!
Пришли исходные фотографии для коллажа в формате ZIP-архива.
Пожалуйста 🙃
'''

send_collage_count = '''Хорошо, теперь давай решим сколько коллажей тебе нужно.
Присылай любое число от {} до {}.'''

start_making_collage = '''Начинаю клепать коллажи...
Может занять какое-то время, напишу как закончу.
'''

not_a_zip_archive = '''Хм... Что-то это не похоже на ZIP-архив.
Давай попробуем еще раз)
'''

collage_count_out_of_range = '''Я не могу сделать меньше {} и больше {}, к сожалению :(
Давай остановимся на каком-нибудь разумном числе ;)
'''

not_a_number = '''Мне нужно целое число - без запятых, точек и других символов 
'''